{"keras_version": "2.1.5", "backend": "tensorflow", "config": [{"config": {"name": "embedding_1", "embeddings_regularizer": null, "output_dim": 32, "activity_regularizer": null, "input_dim": 3800, "embeddings_constraint": null, "mask_zero": false, "input_length": 380, "batch_input_shape": [null, 380], "dtype": "float32", "trainable": true, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.35}, "class_name": "Dropout"}, {"config": {"name": "simple_rnn_1", "return_sequences": false, "stateful": false, "use_bias": true, "bias_constraint": null, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "units": 16, "go_backwards": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "dropout": 0.0, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false}, "class_name": "SimpleRNN"}, {"config": {"name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "trainable": true, "units": 256}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.35}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_regularizer": null, "trainable": true, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential"}